Repository: tollwerk/TYPO3-ext-tw_base
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# file
source: Files & directories
de: Dateien & Verzeichnisse

# file.templateRootPath
source: Path to template files (FE)
de: Pfad zu den Template-Dateien (FE)

# file.partialRootPath
source: Path to template partials (FE)
de: Pfad zu den Partial-Dateien (FE)

# file.layoutRootPath
source: Path to template layouts (FE)
de: Pfad zu den Layout-Dateien (FE)

# file.iconRootPath
source: Icon root directories (more significant ones first)
de: Icon-Wurzelverzeichnisse (hohe Priorität zuerst)

# common
source: Common settings
de: Allgemeine Einstellungen

# common.enable
source: Enable this extension
de: Erweiterung aktivieren

source: Images
de: Bilder

source: Compressors
de: Kompressoren

# compressors.mozjpeg
source: JPEG compressor: Enable the mozjpeg image compressor
de: JPEG-Kompressor: mozjpeg-Bildkompressor aktivieren

# compressors.svgo
source: SVG compressor: Enable the SVGO graphics compressor
de: SVG-Kompressor: SVGO-Grafik-Kompressor aktivieren

# compressors.gzip
source: Text compressor (1): Enable the GZIP text compressor
de: Text-Kompressor (1): GZIP-Text-Kompressor aktivieren

# compressors.brotli
source: Text compressor (2): Enable the Brotli text compressor
de: Text-Kompressor (2): Brotli-Text-Kompressor aktivieren

source: Converters
de: Konverter

# converters.webp
source: WebP converter: Enable automatic encoding of WebP image variants
de: WebP-Konverter: Automatische Kodierung von WebP-Bildvarianten aktivieren

# converters.webp.quality
source: WebP quality (0-100)
de: WebP-Qualität (0-100)

# converters.avif
source: AVIF converter: Enable automatic encoding of AVIF image variants
de: AVIF-Konverter: Automatische Kodierung von AVIF-Bildvarianten aktivieren

# converters.avif.jobs
source: Number of AVIF worker jobs (depends on your hardware)
de: Anzahl von AVIF-Worker-Prozessen (systemabhängig)

# converters.avif.min
source: AVIF minimum quantizer (0-63, 0 = lossless)
de: AVIF Minimum Quantizer (0-63, 0 = verlustfrei)

# converters.avif.max
source: AVIF minimum quantizer (0-63, 0 = lossless)
de: AVIF Maximum Quantizer (0-63, 0 = verlustfrei)

# images.srcset
source: Additional Image Sizes for Responsive Images: Additional image sizes that should be generated for each content image (comma-separated list of either image widths specified in pixels or pixel density descriptors, e. g. "2x")
de: Zusätzliche Bildgrößen für Responsive Bilder: Zusätzliche Bildgrößen, die für jedes Inhaltsbild erzeugt werden sollen (kommaseparierte Liste von Bildbreiten in Pixeln oder Auflösungsfaktoren, z.B. "2x")

# javascript.polyfills
source: Include polyfills
de: Polyfills einschließen

# javascript.featureDetection
source: Include feature detection
de: Feature-Erkennung einschließen

# javascript.lazyLoading
source: Image Lazy Loading
de: Nachladen von Bildern

# javascript.hitArea
source: Link hit area extension
de: Hit-Area-Erweiterung für Links

# images.densities
source: Display Densities for Responsive Images: Comma-separated list of display density descriptors (e. g. "1x, 2x") for the creation of media queries
de: Auflösungsfaktoren für Responsive Bilder: Kommaseparierte Liste von Auflösungsfaktoren (z.B. "1x", "2x") für die Erzeugung von Media Queries

# images.sizes
source: Sizes Query for Responsive Images: Sizes query which tells the browser which of the image sizes should be used in the current environment (%1$d can be used as a placeholder for the calculated image width)
de: Sizes-Angabe für Responsive Bilder: Sizes-Angabe, die dem Browser als Anhaltspunkt für die im aktuellen Kontext zu nutzenden Bildgrößen gibt (%1$d kann als Platzhalter für die kalkulierte Bildbreite genutzt werden)

# images.picturefill
source: Use rendering suggested by picturefill.js and omit the src attribute: See https://github.com/scottjehl/picturefill#the-gotchas for an explanation
de: src-Attribute unterdrücken und die picturefill.js-Implementierung nutzen: Siehe https://github.com/scottjehl/picturefill#the-gotchas für eine Erläuterung

# images.lazyload.lqipmode
source: Lazyload preview image mode: The mode used for generating low-quality lazyloading preview images (LQIP)
de: Vorschaubilder Modus: Modus für die Erzeugung von Vorschaubildern mit niedriger Bildqualität (LQIP)

# images.lazyload.lqipnum
source: Lazyload preview image quality: The number of poligons generated for low-quality lazyloading preview images (LQIP)
de: Vorschaubilder Qualität: Anzahl der Polygone für Vorschaubilder mit niedriger Bildqualität (LQIP)

# images.lazyload.lqipblur
source: Lazyload preview image blur: Standard deviation for the Gaussian Blur filter (0 = no blur effect)
de: Vorschaubilder Weichzeichner: Standard-Deviation für den Gaußschen Weichzeichner (0 = kein Weichzeichner)

# tt_content.tx_twbase_heading_language
source: Heading language
de: Überschriftensprache

# tt_content.tx_twbase_heading_type
source: Visual display
de: Darstellung

# tt_content.tx_twbase_heading_type.default
source: Automatic
de: Automatisch

# tt_content.tx_twbase_heading_type.xx-large
source: Heading level 1 (xx-large)
de: Überschrift Ebene 1 (xx-large)

# tt_content.tx_twbase_heading_type.x-large
source: Heading level 2 (x-large)
de: Überschrift Ebene 2 (x-large)

# tt_content.tx_twbase_heading_type.large
source: Heading level 3 (large)
de: Überschrift Ebene 3 (large)

# tt_content.tx_twbase_heading_type.medium
source: Heading level 4 (medium)
de: Überschrift Ebene 4 (medium)

# tt_content.tx_twbase_heading_type.small
source: Heading level 5 (small)
de: Überschrift Ebene 5 (small)

# tt_content.tx_twbase_heading_type.x-small
source: Heading level 5 (x-small)
de: Überschrift Ebene 6 (x-small)

# tt_content.tx_twbase_heading_type.hidden-significant
source: Hidden, but in outline
de: Versteckt, aber im Inhaltsverzeichnis

# tt_content.tx_twbase_heading_type.hidden-insignificant
source: Hidden
de: Versteckt

# tt_content.tx_twbase_inline
source: Embed inline in source code
de: In Quelltext eingebettet

# tt_content.tx_twbase_lazyload
source: Lazy loading
de: Bei Bedarf nachladen

# tt_content.tx_twbase_responsive
source: Responsive display
de: Responsive Darstellung

# tt_content.tx_twbase_breakpoints
source: Breakpoint preset
de: Vordefinierter Breakpoint-Satz

# tt_content.tx_twbase_skipconverter
source: Skip converters
de: Konverter unterdrücken

# tt_content.tx_twbase_video_tracks.addFileReference
source: Add track file
de: Track-Datei hinzufügen

# tt_content.palette.imageadvanced
source: Responsivity & converters
de: Responsivität & Konverter

# twbase_video.wizard.description
source: A video with multiple sources, poster image and captions
de: Video mit mehreren Quellen, Vorschaubild und Untertiteln

# twbase_video.poster_image
source: Poster image
de: Vorschaubild

# twbase_video.bodytext
source: Fallback text
de: Ersatztext

# twbase_audio.wizard.description
source: A audio with multiple sources
de: Audio mit mehreren Quellen

# twbase_audio.bodytext
source: Fallback text
de: Ersatztext

# pages.tx_twbase_title_language
source: Page title language
de: Sprache der Seitentitel

# pages.tx_twbase_subnav_hide
source: Subpages enabled in menus
de: Unterseiten in Menüs sichtbar

# pages.tx_twbase_seo_title
source: SEO Page Title (optional)
de: SEO Seitentitel (optional)

# pages.tx_twbase_title_language.auto
source: --- Current page language ---
de: --- Aktuelle Seitensprache ---

# linkbrowse.tel
source: Telecom
de: Telekommunikation

# linkbrowse.number
source: Telecom number
de: Rufnummer

# tx_twbase_domain_model_video_track.render
source: Render
de: Darstellen

# tx_twbase_domain_model_video_track.kind
source: Kind
de: Typ

# tx_twbase_domain_model_video_track.kind.subtitles
source: Subtitles
de: Übersetzungen & Hintergrundinfos

# tx_twbase_domain_model_video_track.kind.captions
source: Closed Captions
de: Untertitel

# tx_twbase_domain_model_video_track.kind.descriptions
source: Descriptions
de: Audiodeskription

# tx_twbase_domain_model_video_track.kind.chapters
source: Chapters
de: Kapitel

# tx_twbase_domain_model_video_track.kind.transcript
source: Transcript
de: Transkript

# tx_twbase_domain_model_video_track.file
source: File
de: Datei

# tx_twbase_domain_model_video_track.file.addFileReference
source: Add track file
de: Track-Datei auswählen

# tx_twbase_domain_model_video_track.language
source: Language
de: Sprache

# tx_twbase_domain_model_video_track.transcript
source: Transcript
de: Trankskript

# sys_file_metadata.tabs.license
source: Author & License
de: Autor & Lizenz

# sys_file_metadata.tx_twbase_author
source: Author
de: Autor

# sys_file_metadata.tx_twbase_author_url
source: Author URL
de: Autoren-URL

# sys_file_metadata.tx_twbase_creation_year
source: Creation Year
de: Erzeugungsjahr

# sys_file_metadata.tx_twbase_source_url
source: Source URL
de: Quell-URL

# sys_file_metadata.tx_twbase_license
source: License
de: Lizenz

# sys_file_metadata.tx_twbase_license.none
source: No licensing information
de: Keine Lizenzinformationen

# sys_file_metadata.tx_twbase_license.all
source: All rights reserved
de: Alle Rechte vorbehalten

# sys_file_metadata.tx_twbase_license.cc0
source: No Copyright (CC0)
de: Kein Urheberrechtsschutz (CC0)

# sys_file_metadata.tx_twbase_license.by
source: Attribution 4.0 International (CC BY 4.0)
de: Namensnennung 4.0 International (CC BY 4.0)

# sys_file_metadata.tx_twbase_license.by-sa
source: Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
de: Namensnennung-Share Alike 4.0 International (CC BY-SA 4.0)

# sys_file_metadata.tx_twbase_license.by-nd
source: Attribution-NoDerivatives 4.0 International (CC BY-ND 4.0)
de: Namensnennung-Keine Bearbeitungen 4.0 International (CC BY-ND 4.0)

# sys_file_metadata.tx_twbase_license.by-nc
source: Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)
de: Namensnennung-Nicht kommerziell 4.0 International (CC BY-NC 4.0)

# sys_file_metadata.tx_twbase_license.by-nc-sa
source: Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0)
de: Namensnennung-Nicht kommerziell-Share Alike 4.0 International (CC BY-NC-SA 4.0)

# sys_file_metadata.tx_twbase_license.by-nc-nd
source: Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0)
de: Namensnennung-Nicht kommerziell-Keine Bearbeitungen 4.0 International (CC BY-NC-ND 4.0)

# sys_file_metadata.tx_twbase_license.custom
source: Custom license
de: Anderes Lizenzmodell

# sys_file_metadata.tx_twbase_license.url.cc
source: https://creativecommons.org/licenses/%s/4.0/legalcode
de: https://creativecommons.org/licenses/%s/4.0/legalcode.de

# sys_file_metadata.tx_twbase_license.url.cc0
source: https://creativecommons.org/publicdomain/zero/1.0/deed
de: https://creativecommons.org/publicdomain/zero/1.0/deed.de

# sys_file_metadata.tx_twbase_license_name
source: Custom License Name
de: Anderer Lizenzname

# sys_file_metadata.tx_twbase_license_url
source: Custom License URL
de: Anderer Lizenz-URL
